In [1]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('Olympic.db')

In [2]:
query = "SELECT name FROM sqlite_master WHERE type='table';"

tables = pd.read_sql_query(query, conn)
tables

                    name
0  imported_olympic_data
1                Country
2                Athlete
3                  Sport
4                  Event
5      Events_Of_Country
6      Events_Of_Athlete
7       Games_Of_Country
8                   Game

In [6]:
table_name = 'imported_olympic_data'

query = f"SELECT * FROM {table_name};"
table_data = pd.read_sql_query(query, conn)
table_data

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24,180,80,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NA
1,2,A Lamusi,M,23,170,60,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NA
2,3,Gunnar Nielsen Aaby,M,24,NA,NA,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NA
3,4,Edgar Lindenau Aabye,M,34,NA,NA,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21,185,82,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
271111,135569,Andrzej ya,M,29,179,89,Poland-1,POL,1976 Winter,1976,Winter,Innsbruck,Luge,Luge Mixed (Men)'s Doubles,NA
271112,135570,Piotr ya,M,27,176,59,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Individual",NA
271113,135570,Piotr ya,M,27,176,59,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Team",NA
271114,135571,Tomasz Ireneusz ya,M,30,185,96,Poland,POL,1998 Winter,1998,Winter,Nagano,Bobsleigh,Bobsleigh Men's Four,NA
271115,135571,Tomasz Ireneusz ya,M,34,185,96,Poland,POL,2002 Winter,2002,Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Four,NA

Query columns

In [10]:
columns = table_data.columns
print(columns)

Index(['ID', 'Name', 'Sex', 'Age', 'Height', 'Weight', 'Team', 'NOC', 'Games',
       'Year', 'Season', 'City', 'Sport', 'Event', 'Medal'],
      dtype='object')

In [11]:
grouped_counts = table_data.groupby('Event')['ID'].count()

grouped_counts

Event
Aeronautics Mixed Aeronautics                        1
Alpine Skiing Men's Combined                       569
Alpine Skiing Men's Downhill                      1164
Alpine Skiing Men's Giant Slalom                  1535
Alpine Skiing Men's Slalom                        1593
                                                  ...
Wrestling Women's Flyweight, Freestyle              68
Wrestling Women's Heavyweight, Freestyle            64
Wrestling Women's Light-Heavyweight, Freestyle      18
Wrestling Women's Lightweight, Freestyle            67
Wrestling Women's Middleweight, Freestyle           68
Name: ID, Length: 765, dtype: int64

In [13]:

conn.execute('''
    CREATE TABLE IF NOT EXISTS Country (
        Country_ID INTEGER PRIMARY KEY,
        Name TEXT,
        NOC TEXT
    )
''')

conn.execute('''
    CREATE TABLE IF NOT EXISTS Athlete (
        Athlete_ID INTEGER PRIMARY KEY,
        Name TEXT,
        Sex TEXT,
        Age INTEGER,
        Height TEXT,
        Weight TEXT,
        Team TEXT,
        Medal TEXT,
        Country_ID INTEGER,
        FOREIGN KEY (Country_ID) REFERENCES Country(Country_ID)
    )
''')

conn.execute('''
    CREATE TABLE IF NOT EXISTS Sport (
        Sport_ID INTEGER PRIMARY KEY,
        Sport TEXT
    )
''')

conn.execute('''
    CREATE TABLE IF NOT EXISTS Event (
        Event_ID INTEGER PRIMARY KEY,
        Event_Name TEXT,
        Sport_ID INTEGER,
        FOREIGN KEY (Sport_ID) REFERENCES Sport(Sport_ID)
    )
''')

conn.execute('''
    CREATE TABLE IF NOT EXISTS Game (
        Game_ID INTEGER PRIMARY KEY,
        Games,
        Year INTEGER,
        Season TEXT,
        City TEXT
    )
''')

conn.execute('''
    CREATE TABLE IF NOT EXISTS Events_Of_Country (
        ID INTEGER PRIMARY KEY,
        Country_ID INTEGER,
        Event_ID INTEGER,
        FOREIGN KEY (Country_ID) REFERENCES Country(Country_ID),
        FOREIGN KEY (Event_ID) REFERENCES Event(Event_ID)
    )
''')


conn.execute('''
    CREATE TABLE IF NOT EXISTS Events_Of_Athlete (
        ID INTEGER PRIMARY KEY,
        Athlete_ID INTEGER,
        Event_ID INTEGER,
        FOREIGN KEY (Athlete_ID) REFERENCES Athlete(Athlete_ID),
        FOREIGN KEY (Event_ID) REFERENCES Event(Event_ID)
    )
''')

conn.execute('''
    CREATE TABLE IF NOT EXISTS Games_Of_Country (
        ID INTEGER PRIMARY KEY,
        Country_ID INTEGER,
        Game_ID INTEGER,
        FOREIGN KEY (Country_ID) REFERENCES Country(Country_ID),
        FOREIGN KEY (Game_ID) REFERENCES Game(Game_ID)
    )
''')

conn.execute('''
    CREATE TABLE IF NOT EXISTS Events_Of_Game (
        ID INTEGER PRIMARY KEY,
        Game_ID INTEGER,
        Event_ID INTEGER,
        FOREIGN KEY (Game_ID) REFERENCES Game(Game_ID),
        FOREIGN KEY (Event_ID) REFERENCES Event(Event_ID)
    )
''')

In [26]:

conn.execute('''
    CREATE TABLE IF NOT EXISTS Events_Of_Game (
        ID INTEGER PRIMARY KEY,
        Game_ID INTEGER,
        Event_ID INTEGER,
        FOREIGN KEY (Game_ID) REFERENCES Game(Game_ID),
        FOREIGN KEY (Event_ID) REFERENCES Event(Event_ID)
    )
''')

In [4]:
query = "SELECT name FROM sqlite_master WHERE type='table';"

tables = pd.read_sql_query(query, conn)
tables

                    name
0  imported_olympic_data
1                Country
2                Athlete
3                  Sport
4                  Event
5      Events_Of_Country
6      Events_Of_Athlete
7       Games_Of_Country
8                   Game

Insert datas

In [7]:
query = f"SELECT NOC FROM {table_name} group by NOC;"
country_data = pd.read_sql_query(query, conn)
country_data

     NOC
0    AFG
1    AHO
2    ALB
3    ALG
4    AND
..   ...
225  YEM
226  YMD
227  YUG
228  ZAM
229  ZIM

[230 rows x 1 columns]

In [8]:
conn.execute('DELETE FROM Country')

for index, row in country_data.iterrows():
    country_query = f"INSERT INTO Country (Country_ID, Name, NOC) VALUES ({index+1}, '{row.NOC}', '{row.NOC}')"
    conn.execute(country_query)
conn.commit()

In [9]:
query = f"SELECT DISTINCT Country_ID, NOC FROM Country;"
Country = pd.read_sql_query(query, conn)
Country

     Country_ID  NOC
0             1  AFG
1             2  AHO
2             3  ALB
3             4  ALG
4             5  AND
..          ...  ...
225         226  YEM
226         227  YMD
227         228  YUG
228         229  ZAM
229         230  ZIM

[230 rows x 2 columns]

In [10]:
country_data = country_data.reset_index()
country_data['index'] = country_data['index'] + 1
country_data

     index  NOC
0        1  AFG
1        2  AHO
2        3  ALB
3        4  ALG
4        5  AND
..     ...  ...
225    226  YEM
226    227  YMD
227    228  YUG
228    229  ZAM
229    230  ZIM

[230 rows x 2 columns]

In [111]:
country_data = country_data[['index', 'NOC']]
country_data

     index  NOC
0        1  AFG
1        2  AHO
2        3  ALB
3        4  ALG
4        5  AND
..     ...  ...
225    226  YEM
226    227  YMD
227    228  YUG
228    229  ZAM
229    230  ZIM

[230 rows x 2 columns]

In [11]:
query = f"SELECT Name, Sex, Age, Height, Weight, Team, Medal, (SELECT Country_ID FROM Country c WHERE c.NOC = NOC) as Country_ID  FROM {table_name} group by Name, Sex, Age, Height, Weight, Team, Medal, NOC;"
athlete_data = pd.read_sql_query(query, conn)
athlete_data = athlete_data.reset_index()
athlete_data['index'] = athlete_data['index'] + 1
athlete_data

,index,Name,Sex,Age,Height,Weight,Team,Medal,Country_ID
0,1,"Gabrielle Marie ""Gabby"" Adcock (White-)",F,25,167,NA,Great Britain,NA,1
1,2,Eleonora Margarida Josephina Scmitt,F,16,NA,NA,Brazil,NA,1
2,3,Jean Hauptmanns,M,26,NA,NA,Germany,NA,1
3,4,Luis ngel Fernando de los Santos Grossi,M,23,NA,NA,Uruguay,NA,1
4,5,Luis ngel Fernando de los Santos Grossi,M,27,NA,NA,Uruguay,NA,1
...,...,...,...,...,...,...,...,...,...
199476,199477,zlem Kaya,F,26,165,47,Turkey,NA,1
199477,199478,zman Graud,M,33,168,72,Turkey,NA,1
199478,199479,zzet Safer,M,26,178,74,Turkey,NA,1
199479,199480,zzet nce,M,23,172,85,Turkey,NA,1
199480,199481,zzet nce,M,27,172,85,Turkey,NA,1

In [12]:
conn.execute("DELETE from Athlete")

for index, row in athlete_data.iterrows():
    athlete_query = f"INSERT INTO Athlete VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)"
    row = [None if pd.isna(value) or value == 'NA' else value for value in row]
    conn.execute(athlete_query, row)
conn.commit()

In [13]:
query = f"SELECT * FROM Athlete Limit 50;"
Athlete = pd.read_sql_query(query, conn)
Athlete

,Athlete_ID,Name,Sex,Age,Height,Weight,Team,Medal,Country_ID
0,1,"Gabrielle Marie ""Gabby"" Adcock (White-)",F,25.0,167,None,Great Britain,None,1
1,2,Eleonora Margarida Josephina Scmitt,F,16.0,None,None,Brazil,None,1
2,3,Jean Hauptmanns,M,26.0,None,None,Germany,None,1
3,4,Luis ngel Fernando de los Santos Grossi,M,23.0,None,None,Uruguay,None,1
4,5,Luis ngel Fernando de los Santos Grossi,M,27.0,None,None,Uruguay,None,1
5,6,Th Anh,F,20.0,165,58,Vietnam,None,1
6,7,Th Ngn Thng,F,19.0,147,47,Vietnam,None,1
7,8,Th Ngn Thng,F,23.0,147,47,Vietnam,None,1
8,9,Tin Tun,M,21.0,173,63,Vietnam,None,1
9,10,A Dijiang,M,24.0,180,80,China,None,1
10,11,A Lamusi,M,23.0,170,60,China,None,1
11,12,A. Aanantha Sambu Mayavo,M,26.0,None,None,Malaysia,None,1
12,13,A. Abdul Razzak,M,NaN,178,70,Iraq,None,1
13,14,A. Albert,M,NaN,None,None,Union des Socits Franais de Sports Athletiques,Gold,1
14,15,A. Brun,F,NaN,None,None,France,None,1
15,16,A. Buydens,M,NaN,None,None,Belgium,None,1
16,17,A. Charles Six,M,NaN,None,None,France,None,1
17,18,A. Christory,M,NaN,None,None,France,None,1
18,19,A. Darnis,M,NaN,None,None,France,None,1
19,20,A. Dubois,M,NaN,None,None,Gitana-2,Bronze,1
20,21,A. Dubois,M,NaN,None,None,Gitana-2,Silver,1
21,22,A. Dubois,M,NaN,None,None,Gitana-21,None,1
22,23,A. Duponcheel,M,NaN,None,None,France,None,1
23,24,A. E. Page,M,NaN,None,None,Great Britain,None,1
24,25,A. G. Chagale,M,NaN,None,None,India,None,1
25,26,A. Germaine Golding (Regnier-),F,NaN,None,None,France,None,1
26,27,A. Germaine Golding (Regnier-),F,NaN,None,None,France-1,None,1
27,28,A. Godinat,M,NaN,None,None,France,None,1
28,29,A. Hurtado Vargas,M,NaN,None,None,Chile,None,1
29,30,A. Hussain Ahmed,M,NaN,None,None,India,None,1
30,31,A. J. J. Fridt,M,NaN,None,None,Ubu,None,1
31,32,"A. J. Tyronne Benildus ""Benny"" Fernando",M,27.0,179,70,Sri Lanka,None,1
32,33,"A. Joshua ""Josh"" West",M,27.0,207,105,Great Britain,None,1
33,34,"A. Joshua ""Josh"" West",M,31.0,207,105,Great Britain,Silver,1
34,35,A. Kordonis,M,NaN,None,None,"Phalainis ton Thorichtou ""Psara""-3",None,1
35,36,A. Laffen,M,NaN,None,None,Unknown,None,1
36,37,A. Lafontaine,M,NaN,None,None,France,None,1
37,38,"A. Lambrecht, Jr.",M,NaN,None,None,Belgium,None,1
38,39,A. Lawry,M,NaN,None,None,Cornwall,Silver,1
39,40,A. M. Woods,M,NaN,None,None,St. Louis Amateur Athletic Association,Silver,1
40,41,A. O. Pinner,M,NaN,None,None,Great Britain,None,1
41,42,A. Papadakis,M,NaN,None,None,Greece,None,1
42,43,A. Porcher,M,NaN,None,None,France,None,1
43,44,A. Priftis,M,NaN,None,None,Greece,None,1
44,45,A. R. Upton,M,NaN,None,None,Brussels Swimming and Water Polo Club,Silver,1
45,46,A. Roger,M,NaN,None,None,France,None,1
46,47,A. S. Harley,M,NaN,None,None,Great Britain,None,1
47,48,A. Sattar Basheer,M,NaN,None,None,India,None,1
48,49,A. Schmitt,M,NaN,None,None,Switzerland,None,1
49,50,A. Tark Erilmez,M,NaN,None,None,Turkey,None,1

In [14]:
query = f"SELECT Sport FROM {table_name} group by Sport;"
Sport_data = pd.read_sql_query(query, conn)
Sport_data = Sport_data.reset_index()
Sport_data['index'] = Sport_data['index'] + 1
Sport_data

    index             Sport
0       1       Aeronautics
1       2     Alpine Skiing
2       3          Alpinism
3       4           Archery
4       5  Art Competitions
..    ...               ...
61     62        Tug-Of-War
62     63        Volleyball
63     64        Water Polo
64     65     Weightlifting
65     66         Wrestling

[66 rows x 2 columns]

In [15]:
conn.execute("DELETE from Sport")

for index, row in Sport_data.iterrows():
    sport_query = f"INSERT INTO Sport VALUES (?, ?)"
    row = [None if pd.isna(value) or value == 'NA' else value for value in row]
    conn.execute(sport_query, row)

conn.commit()

In [16]:
query = f'SELECT * FROM Sport;'
data = pd.read_sql_query(query, conn)
data

    Sport_ID             Sport
0          1       Aeronautics
1          2     Alpine Skiing
2          3          Alpinism
3          4           Archery
4          5  Art Competitions
..       ...               ...
61        62        Tug-Of-War
62        63        Volleyball
63        64        Water Polo
64        65     Weightlifting
65        66         Wrestling

[66 rows x 2 columns]

In [17]:
query = f'SELECT DISTINCT Event,NOC FROM {table_name} WHERE Event = "Cross Country Skiing Men\'s 10 kilometres";'
data = pd.read_sql_query(query, conn)
data

                                       Event  NOC
0   Cross Country Skiing Men's 10 kilometres  USA
1   Cross Country Skiing Men's 10 kilometres  KOR
2   Cross Country Skiing Men's 10 kilometres  ITA
3   Cross Country Skiing Men's 10 kilometres  ARG
4   Cross Country Skiing Men's 10 kilometres  NOR
5   Cross Country Skiing Men's 10 kilometres  MEX
6   Cross Country Skiing Men's 10 kilometres  GRE
7   Cross Country Skiing Men's 10 kilometres  ROU
8   Cross Country Skiing Men's 10 kilometres  UKR
9   Cross Country Skiing Men's 10 kilometres  SUI
10  Cross Country Skiing Men's 10 kilometres  FRA
11  Cross Country Skiing Men's 10 kilometres  YUG
12  Cross Country Skiing Men's 10 kilometres  BIH
13  Cross Country Skiing Men's 10 kilometres  SVK
14  Cross Country Skiing Men's 10 kilometres  BUL
15  Cross Country Skiing Men's 10 kilometres  CZE
16  Cross Country Skiing Men's 10 kilometres  GER
17  Cross Country Skiing Men's 10 kilometres  GBR
18  Cross Country Skiing Men's 10 kilometres  TCH
19  Cross Country Skiing Men's 10 kilometres  CAN
20  Cross Country Skiing Men's 10 kilometres  DEN
21  Cross Country Skiing Men's 10 kilometres  KEN
22  Cross Country Skiing Men's 10 kilometres  EUN
23  Cross Country Skiing Men's 10 kilometres  RUS
24  Cross Country Skiing Men's 10 kilometres  ESP
25  Cross Country Skiing Men's 10 kilometres  POL
26  Cross Country Skiing Men's 10 kilometres  PRK
27  Cross Country Skiing Men's 10 kilometres  MAR
28  Cross Country Skiing Men's 10 kilometres  MGL
29  Cross Country Skiing Men's 10 kilometres  MKD
30  Cross Country Skiing Men's 10 kilometres  BLR
31  Cross Country Skiing Men's 10 kilometres  JPN
32  Cross Country Skiing Men's 10 kilometres  ISL
33  Cross Country Skiing Men's 10 kilometres  AUS
34  Cross Country Skiing Men's 10 kilometres  SWE
35  Cross Country Skiing Men's 10 kilometres  AUT
36  Cross Country Skiing Men's 10 kilometres  LAT
37  Cross Country Skiing Men's 10 kilometres  LIE
38  Cross Country Skiing Men's 10 kilometres  FIN
39  Cross Country Skiing Men's 10 kilometres  KAZ
40  Cross Country Skiing Men's 10 kilometres  EST
41  Cross Country Skiing Men's 10 kilometres  SLO
42  Cross Country Skiing Men's 10 kilometres  HUN
43  Cross Country Skiing Men's 10 kilometres  TUR
44  Cross Country Skiing Men's 10 kilometres  LTU
45  Cross Country Skiing Men's 10 kilometres  CHN
46  Cross Country Skiing Men's 10 kilometres  CRO
47  Cross Country Skiing Men's 10 kilometres  FIJ
48  Cross Country Skiing Men's 10 kilometres  SMR

In [18]:
query = f"SELECT DISTINCT Event, (SELECT Sport_ID from Sport s where s.Sport = Sport) as Sport_ID FROM {table_name};"
Event_data = pd.read_sql_query(query, conn)
Event_data = Event_data.reset_index()
Event_data = Event_data.rename(columns={'index': 'Event_ID'})

Event_data

     Event_ID                                              Event  Sport_ID
0           0                        Basketball Men's Basketball         1
1           1                       Judo Men's Extra-Lightweight         1
2           2                            Football Men's Football         1
3           3                        Tug-Of-War Men's Tug-Of-War         1
4           4                   Speed Skating Women's 500 metres         1
..        ...                                                ...       ...
760       760    Weightlifting Men's All-Around Dumbbell Contest         1
761       761               Archery Men's Au Chapelet, 33 metres         1
762       762            Archery Men's Au Cordon Dore, 33 metres         1
763       763  Archery Men's Target Archery, 28 metres, Indiv...         1
764       764                      Aeronautics Mixed Aeronautics         1

[765 rows x 3 columns]

In [19]:
conn.execute("DELETE from Event")

for index, row in Event_data[['Event_ID', 'Event', 'Sport_ID']].iterrows():
    event_query = f"INSERT INTO Event VALUES (?, ?, ?)"
    row = [None if pd.isna(value) or value == 'NA' else value for value in row]
    conn.execute(event_query, row)

conn.commit()

In [20]:
query = f'SELECT * FROM Event;'
data = pd.read_sql_query(query, conn)
data

     Event_ID                                         Event_Name  Sport_ID
0           0                        Basketball Men's Basketball         1
1           1                       Judo Men's Extra-Lightweight         1
2           2                            Football Men's Football         1
3           3                        Tug-Of-War Men's Tug-Of-War         1
4           4                   Speed Skating Women's 500 metres         1
..        ...                                                ...       ...
760       760    Weightlifting Men's All-Around Dumbbell Contest         1
761       761               Archery Men's Au Chapelet, 33 metres         1
762       762            Archery Men's Au Cordon Dore, 33 metres         1
763       763  Archery Men's Target Archery, 28 metres, Indiv...         1
764       764                      Aeronautics Mixed Aeronautics         1

[765 rows x 3 columns]

In [21]:
query = f"SELECT  Year, Season, City, Games FROM {table_name} GROUP BY Year, Season, City, Games;"
game_data = pd.read_sql_query(query, conn)
game_data = game_data.reset_index()
game_data = game_data.rename(columns={'index': 'Game_ID'})
game_data

    Game_ID  Year  Season                    City        Games
0         0  1896  Summer                  Athina  1896 Summer
1         1  1900  Summer                   Paris  1900 Summer
2         2  1904  Summer               St. Louis  1904 Summer
3         3  1906  Summer                  Athina  1906 Summer
4         4  1908  Summer                  London  1908 Summer
5         5  1912  Summer               Stockholm  1912 Summer
6         6  1920  Summer               Antwerpen  1920 Summer
7         7  1924  Summer                   Paris  1924 Summer
8         8  1924  Winter                Chamonix  1924 Winter
9         9  1928  Summer               Amsterdam  1928 Summer
10       10  1928  Winter            Sankt Moritz  1928 Winter
11       11  1932  Summer             Los Angeles  1932 Summer
12       12  1932  Winter             Lake Placid  1932 Winter
13       13  1936  Summer                  Berlin  1936 Summer
14       14  1936  Winter  Garmisch-Partenkirchen  1936 Winter
15       15  1948  Summer                  London  1948 Summer
16       16  1948  Winter            Sankt Moritz  1948 Winter
17       17  1952  Summer                Helsinki  1952 Summer
18       18  1952  Winter                    Oslo  1952 Winter
19       19  1956  Summer               Melbourne  1956 Summer
20       20  1956  Summer               Stockholm  1956 Summer
21       21  1956  Winter       Cortina d'Ampezzo  1956 Winter
22       22  1960  Summer                    Roma  1960 Summer
23       23  1960  Winter            Squaw Valley  1960 Winter
24       24  1964  Summer                   Tokyo  1964 Summer
25       25  1964  Winter               Innsbruck  1964 Winter
26       26  1968  Summer             Mexico City  1968 Summer
27       27  1968  Winter                Grenoble  1968 Winter
28       28  1972  Summer                  Munich  1972 Summer
29       29  1972  Winter                 Sapporo  1972 Winter
30       30  1976  Summer                Montreal  1976 Summer
31       31  1976  Winter               Innsbruck  1976 Winter
32       32  1980  Summer                  Moskva  1980 Summer
33       33  1980  Winter             Lake Placid  1980 Winter
34       34  1984  Summer             Los Angeles  1984 Summer
35       35  1984  Winter                Sarajevo  1984 Winter
36       36  1988  Summer                   Seoul  1988 Summer
37       37  1988  Winter                 Calgary  1988 Winter
38       38  1992  Summer               Barcelona  1992 Summer
39       39  1992  Winter             Albertville  1992 Winter
40       40  1994  Winter             Lillehammer  1994 Winter
41       41  1996  Summer                 Atlanta  1996 Summer
42       42  1998  Winter                  Nagano  1998 Winter
43       43  2000  Summer                  Sydney  2000 Summer
44       44  2002  Winter          Salt Lake City  2002 Winter
45       45  2004  Summer                  Athina  2004 Summer
46       46  2006  Winter                  Torino  2006 Winter
47       47  2008  Summer                 Beijing  2008 Summer
48       48  2010  Winter               Vancouver  2010 Winter
49       49  2012  Summer                  London  2012 Summer
50       50  2014  Winter                   Sochi  2014 Winter
51       51  2016  Summer          Rio de Janeiro  2016 Summer

In [22]:
conn.execute("DELETE from Game")

for index, row in game_data[['Game_ID', 'Games', 'Year', 'Season', 'City']].iterrows():
    game_query = f"INSERT INTO Game VALUES (?, ?, ?, ?, ?)"
    row = [None if pd.isna(value) or value == 'NA' else value for value in row]
    conn.execute(game_query, row)
conn.commit()

In [23]:
query = f"SELECT * from Event;"
data = pd.read_sql_query(query, conn)

data

     Event_ID                                         Event_Name  Sport_ID
0           0                        Basketball Men's Basketball         1
1           1                       Judo Men's Extra-Lightweight         1
2           2                            Football Men's Football         1
3           3                        Tug-Of-War Men's Tug-Of-War         1
4           4                   Speed Skating Women's 500 metres         1
..        ...                                                ...       ...
760       760    Weightlifting Men's All-Around Dumbbell Contest         1
761       761               Archery Men's Au Chapelet, 33 metres         1
762       762            Archery Men's Au Cordon Dore, 33 metres         1
763       763  Archery Men's Target Archery, 28 metres, Indiv...         1
764       764                      Aeronautics Mixed Aeronautics         1

[765 rows x 3 columns]

In [24]:
query = f"SELECT DISTINCT (SELECT Event_ID FROM Event e where e.Event_Name = a.Event) as Event_ID, (SELECT Game_ID FROM Game g where g.Games = a.Games) as Game_ID FROM {table_name} a;"
Events_Of_Game = pd.read_sql_query(query, conn)
Events_Of_Game = Events_Of_Game.reset_index()
Events_Of_Game['index'] = Events_Of_Game['index'] + 1

Events_Of_Game

      index  Event_ID  Game_ID
0         1         0       38
1         2         1       49
2         3         2        6
3         4         3        1
4         5         4       37
...     ...       ...      ...
6187   6188       763        6
6188   6189       478        3
6189   6190       692       11
6190   6191       764       13
6191   6192       688        6

[6192 rows x 3 columns]

In [27]:
conn.execute("DELETE from Events_Of_Game")

for index, row in Events_Of_Game.iterrows():
    query = f"INSERT INTO Events_Of_Game VALUES (?, ?, ?)"
    row = [None if pd.isna(value) or value == 'NA' else value for value in row]
    conn.execute(query, row)
conn.commit()

In [29]:
query = f"SELECT * from Events_Of_Game;"
data = pd.read_sql_query(query, conn)

data

        ID  Game_ID  Event_ID
0        1        0        38
1        2        1        49
2        3        2         6
3        4        3         1
4        5        4        37
...    ...      ...       ...
6187  6188      763         6
6188  6189      478         3
6189  6190      692        11
6190  6191      764        13
6191  6192      688         6

[6192 rows x 3 columns]

In [30]:
query = f"SELECT DISTINCT (SELECT Event_ID FROM Event e where e.Event_Name = a.Event) as Event_ID, (SELECT Country_ID FROM Country c where c.NOC = a.NOC) as Country_ID FROM {table_name} a;"
Events_Of_Country = pd.read_sql_query(query, conn)
Events_Of_Country = Events_Of_Country.reset_index()
Events_Of_Country['index'] = Events_Of_Country['index'] + 1

Events_Of_Country

       index  Event_ID  Country_ID
0          1         0          42
1          2         1          42
2          3         2          56
3          4         3          56
4          5         4         146
...      ...       ...         ...
28332  28333        11         127
28333  28334       641         182
28334  28335       236         182
28335  28336       144          93
28336  28337       609          82

[28337 rows x 3 columns]

In [31]:
conn.execute("DELETE from Events_Of_Country")

for index, row in Events_Of_Country.iterrows():
    query = f"INSERT INTO Events_Of_Country VALUES (?, ?, ?)"
    row = [None if pd.isna(value) or value == 'NA' else value for value in row]
    conn.execute(query, row)

conn.commit()

In [32]:
query = f"SELECT * from Events_Of_Country;"
data = pd.read_sql_query(query, conn)
data

          ID  Country_ID  Event_ID
0          1           0        42
1          2           1        42
2          3           2        56
3          4           3        56
4          5           4       146
...      ...         ...       ...
28332  28333          11       127
28333  28334         641       182
28334  28335         236       182
28335  28336         144        93
28336  28337         609        82

[28337 rows x 3 columns]

In [33]:
query = f"SELECT DISTINCT (SELECT Event_ID FROM Event e where e.Event_Name = a.Event) as Event_ID, (SELECT Athlete_ID FROM Athlete c where c.Name = a.Name) as Athlete_ID FROM {table_name} a;"
Events_Of_Athlete = pd.read_sql_query(query, conn)
Events_Of_Athlete = Events_Of_Athlete.reset_index()
Events_Of_Athlete['index'] = Events_Of_Athlete['index'] + 1

Events_Of_Athlete

         index  Event_ID  Athlete_ID
0            1         0          10
1            2         1          11
2            3         2       64755
3            4         3       43178
4            5         4       31404
...        ...       ...         ...
207429  207430        82      141245
207430  207431       461       12721
207431  207432       418      150876
207432  207433       419      150876
207433  207434        50      180181

[207434 rows x 3 columns]

In [35]:
conn.execute("DELETE from Events_Of_Athlete")

for index, row in Events_Of_Athlete.iterrows():
    query = f"INSERT INTO Events_Of_Athlete VALUES (?, ?, ?)"
    row = [None if pd.isna(value) or value == 'NA' else value for value in row]
    conn.execute(query, row)

conn.commit()

In [36]:
query = f"SELECT * from Events_Of_Athlete;"
data = pd.read_sql_query(query, conn)
data

            ID  Athlete_ID  Event_ID
0            1           0        10
1            2           1        11
2            3           2     64755
3            4           3     43178
4            5           4     31404
...        ...         ...       ...
207429  207430          82    141245
207430  207431         461     12721
207431  207432         418    150876
207432  207433         419    150876
207433  207434          50    180181

[207434 rows x 3 columns]

In [37]:
query = f"SELECT DISTINCT (SELECT Country_ID FROM Country c where c.NOC = a.NOC) as Country_ID, (SELECT Game_ID FROM Game g where g.Games = a.Games) as Game_ID FROM {table_name} a;"
Games_Of_Country = pd.read_sql_query(query, conn)
Games_Of_Country = Games_Of_Country.reset_index()
Games_Of_Country['index'] = Games_Of_Country['index'] + 1

Games_Of_Country

      index  Country_ID  Game_ID
0         1          42       38
1         2          42       49
2         3          56        6
3         4          56        1
4         5         146       37
...     ...         ...      ...
3832   3833         191        4
3833   3834         163        5
3834   3835          42       17
3835   3836         203       47
3836   3837         208       40

[3837 rows x 3 columns]

In [38]:
conn.execute("DELETE from Games_Of_Country")

for index, row in Games_Of_Country.iterrows():
    query = f"INSERT INTO Games_Of_Country VALUES (?, ?, ?)"
    row = [None if pd.isna(value) or value == 'NA' else value for value in row]
    conn.execute(query, row)

conn.commit()

In [39]:
query = f"SELECT * from Games_Of_Country;"
data = pd.read_sql_query(query, conn)
data

        ID  Country_ID  Game_ID
0        1          42       38
1        2          42       49
2        3          56        6
3        4          56        1
4        5         146       37
...    ...         ...      ...
3832  3833         191        4
3833  3834         163        5
3834  3835          42       17
3835  3836         203       47
3836  3837         208       40

[3837 rows x 3 columns]

In [40]:
conn.close()